# 02-DataFrame

- 엑셀의 표 형태로 구성도니 데이터 분석의 가장 기본적인 자료구조
- **열**과 **행**으로 구성된다.
    - **열** : column이나 변수라고도 부름
    - **행** : row나 index라고도 부름
- `열 > 행 ` 순으로 값에 접근한다.

## #01. 필수 패키지 참조

### 1) xlsx 파일을 불러오기 위한 의존성 설치
엑셀 파일로부터 DataFrame을 생성하기 위해서는 pandas 모듈 내의 ExcelFile 클래스가 의존하는 모듈들을 
추가적으로 설치해야 한다.

```
pip install --upgrade openpyxl
pip install --upgrade xlrd
```

### 2) 패키지 가져오기

In [5]:
# pandas 패키지 참조
from pandas import DataFrame  # 데이터프레임 클래스
from pandas import read_csv   # csv 파일 읽어들이기 위한 함수
from pandas import ExcelFile  # Excel 파일을 읽어들기 위한 함수

## #02. 데이터프레임을 생성하기 
```python
리턴받을객체 = DataFrame(데이터, index=[인덱스이름을 위한 리스트], columns=[컬럼이름을 위한 리스트])
```

### 1) 데이터의 종류
1. 2차원 리스트
1. 리스트를 원소로 갖는 딕셔너리
1. 동일한 구조를 갖는 딕셔너리들이 모인 리스트
1. csv 파일
1. xlsx 파일

### 2) 2차원 리스트를 사용한 DataFrame 생성

#### 기본 생성

각각의 1차 리스트개 DataFrame에서 하나의 행으로 지정된다.

컬럼과 인덱스 이름은 0부터 순차적으로 일련번호가 부여된다.

> DataFrame에서 빈값은 None으로 지정한다.<br> 이는 조사 과정에서 측정되지 않은 상태를 의미하며 이러한 형태의 빈 값을 
**결측치**라고 한다.

In [6]:
source = [
    [1, '남자', 98,88,64] ,
    [2, '여자', 88,90,62,72] ,
    [1, '남자', 92,70,None,None] ,
    [3, '여자', 63,60,31,70] ,
    [4, '남자', 120,50,None,88]
]
df = DataFrame(source)
df

   0   1    2   3     4     5
0  1  남자   98  88  64.0   NaN
1  2  여자   88  90  62.0  72.0
2  1  남자   92  70   NaN   NaN
3  3  여자   63  60  31.0  70.0
4  4  남자  120  50   NaN  88.0

컬럼과 인덱스 이름 지정하기

In [7]:
df = DataFrame(source,
              columns=['학년','성별','국어','영어','수학','과학'],
              index=['철수','영희','민수','수현','호영'])
df

    학년  성별   국어  영어    수학    과학
철수   1  남자   98  88  64.0   NaN
영희   2  여자   88  90  62.0  72.0
민수   1  남자   92  70   NaN   NaN
수현   3  여자   63  60  31.0  70.0
호영   4  남자  120  50   NaN  88.0

### 2) 리스트를 원소로 갖는 딕셔너리를 사용한 DataFrame 생성

딕셔너리의 key가 컬럼의 이름으로 사용되기 때문에 index만 추가적으로 지정한다.

In [8]:
source = {
    '학년' : [1,2,1,3,4],
    '성별' : ['남자','여자','남자','여자','남자'],
    '국어' : [98,88,92,63,120],
    '영어' : [88,90,70,60,50],
    '수학' : [64,62,None,31,None],
    '과학' : [None,72,None,70,88]
}

df = DataFrame(source,index=['철수','영희','민수','수현','호영'])
df

    학년  성별   국어  영어    수학    과학
철수   1  남자   98  88  64.0   NaN
영희   2  여자   88  90  62.0  72.0
민수   1  남자   92  70   NaN   NaN
수현   3  여자   63  60  31.0  70.0
호영   4  남자  120  50   NaN  88.0

### 3) 동일한 구조를 갖는 딕셔너리들이 모인 리스트를 사용한 DataFrame 생성

딕셔너리의 key가 컬럼의 이름으로 사용되기 때문에 index만 추가적으로 지정한다.

In [9]:
source = [
    {'학년':1, '성별':'남자', '국어':98, '영어':88,'수학':64,'과학':None},
    {'학년':2, '성별':'여자', '국어':88, '영어':90,'수학':62,'과학':72},
    {'학년':1, '성별':'남자', '국어':92, '영어':70,'수학':None,'과학':None},
    {'학년':3, '성별':'여자', '국어':63, '영어':60,'수학':31,'과학':70},
    {'학년':4, '성별':'남자', '국어':120, '영어':50,'수학':None,'과학':88},
]
df = DataFrame(source,index=['철수','영희','민수','수현','호영'])
df

    학년  성별   국어  영어    수학    과학
철수   1  남자   98  88  64.0   NaN
영희   2  여자   88  90  62.0  72.0
민수   1  남자   92  70   NaN   NaN
수현   3  여자   63  60  31.0  70.0
호영   4  남자  120  50   NaN  88.0

### 4)  CSV파일을 DataFrame으로 변환하기 

```python
리턴받을객체 = read_csv("파일경로", encoding="euc-kr|utf-8")
```
* `encoding`의 기본값은 `utf-8`  
    - MS-Office 2019 미만 버전에서 생성하는 경우 무조건 `euc-kr`
* 파일경로는 상대경로, 절대경로, URL 형식이 가능함.

> 외부에서 csv나 xlsx 파일을 가져오는 경우 index가 인식되지 않기 때문에 특정 컬럼의 값들을 
인덱스로 지정하고 그 컬럼을 삭제하는  전처리가 필요하다. (뒤에서 다룹니다.)

In [11]:
df1 = read_csv('grade.csv', encoding='euc-kr')
df1

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

In [12]:
df = read_csv('http://itpaper.co.kr/demo/py/grade.csv', encoding='euc-kr')
df

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

### 5) xlsx 파일을 통한 생성

엑셀파일을 객체 형태로 가져온다.

In [14]:
xls1 = ExcelFile('grade.xlsx')
xls1

In [15]:
xls = ExcelFile('http://itpaper.co.kr/demo/py/grade.xlsx')
xls

#### 엑셀 파일의 sheet이름에 대한 리스트

In [16]:
xls.sheet_names

['grade']

#### 가져오고자하는 sheet 이름을 지정하여 데이터프레임으로 변환

In [17]:
df = xls.parse(xls.sheet_names[0])
df

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

## #03. 데이터에 접근하기

### 1) 데이터 개요 확인

#### 데이터의 크기

튜플 타입으로 행, 열의 크기가 반환된다.

In [19]:
size = df.shape
size

(5, 7)

튜플이므로 행과 열을 구성하는 변수에 나누어 저장 가능

In [21]:
rows, cols = df.shape
print(rows)
print(cols)

5
7

### 2) 상위 3건 확인하기 

파라미터가 생략될 경우 상위 5건을 반환한다.

In [22]:
top3 = df.head(3)
top3

   이름  학년  성별  국어    영어    수학    과학
0  철수   1  남자  98   NaN  88.0  64.0
1  영희   2  여자  88  90.0  62.0  72.0
2  민수   1  남자  92  70.0   NaN   NaN

### 3) 하위 3건 확인하기 

파라미터가 생략될 경우 하위 5건을 반환한다.

In [23]:
last3 = df.tail(3)
last3

   이름  학년  성별   국어    영어    수학    과학
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

#### 인덱스 이름 확인

In [24]:
df.index

RangeIndex(start=0, stop=5, step=1)

##### 인덱스 이름을 리스트로 변환

In [25]:
i_list = list(df.index)
i_list

[0, 1, 2, 3, 4]

#### 컬럼 이름 확인

In [26]:
df.columns

Index(['이름', '학년', '성별', '국어', '영어', '수학', '과학'], dtype='object')

#### 인덱스 이름을 리스트로 변환

In [27]:
c_list = list(df.columns)
c_list

['이름', '학년', '성별', '국어', '영어', '수학', '과학']

#### 데이터의 값들만 확인

2차 배열로 반환된다.

In [29]:
print(type(df.values))
df.values

<class 'numpy.ndarray'>

array([['철수', 1, '남자', 98, nan, 88.0, 64.0],
       ['영희', 2, '여자', 88, 90.0, 62.0, 72.0],
       ['민수', 1, '남자', 92, 70.0, nan, nan],
       ['수현', 3, '여자', 63, 60.0, 31.0, 70.0],
       ['호영', 4, '남자', 120, 50.0, nan, 88.0]], dtype=object)

#### 전치 구하기 

행과 열이 서로 바뀐 형태

In [30]:
df_t = df.T
df_t

      0   1    2   3    4
이름   철수  영희   민수  수현   호영
학년    1   2    1   3    4
성별   남자  여자   남자  여자   남자
국어   98  88   92  63  120
영어  NaN  90   70  60   50
수학   88  62  NaN  31  NaN
과학   64  72  NaN  70   88

### 2) **열** 단위의 데이터 접근

#### 각 열 별로 데이터 타입 확인

In [31]:
df.dtypes

이름     object
학년      int64
성별     object
국어      int64
영어    float64
수학    float64
과학    float64
dtype: object

#### 특정 열에 대한 타입과 값 확인

DataFreame의 각 열은 Series로 구성되어 있음을 알 수 있다.

In [32]:
print(type(df['국어']))
df['국어']

<class 'pandas.core.series.Series'>

0     98
1     88
2     92
3     63
4    120
Name: 국어, dtype: int64

#### 특정 열의 값들을 numpy 배열로 변환

In [33]:
arr = df['국어'].values
print(type(arr))
arr

<class 'numpy.ndarray'>

array([ 98,  88,  92,  63, 120], dtype=int64)

#### 열의 값들을 list로 변환

In [36]:
ls = list(df['국어'])
print(type(ls))
ls

<class 'list'>

[98, 88, 92, 63, 120]

### 3) **행** 단위로 접근하기

반드시 `loc`이라는 속성을 통해서 접근해야 한다.

#### 하나의 행에 속한 모든 데이터 추출

인덱스가 0인 행을 가져온다. 인덱스 이름이 문자열로 되어 있는 경우 해당 문자열을 지정한다.

In [37]:
cs = df.loc[0]
print(type(cs))
cs

<class 'pandas.core.series.Series'>

이름     철수
학년      1
성별     남자
국어     98
영어    NaN
수학     88
과학     64
Name: 0, dtype: object

#### 행의 값들을 numpy 배열로 변환

In [38]:
arr = df.loc[0].values
print(type(arr))
arr

<class 'numpy.ndarray'>

array(['철수', 1, '남자', 98, nan, 88.0, 64.0], dtype=object)

#### 행의 값들을 list로 변환

In [39]:
ls = list(df.loc[0])
print(type(ls))
ls

<class 'list'>

['철수', 1, '남자', 98, nan, 88.0, 64.0]

### 4) 특정 위치의 값에 직접 접근

#### 열 > 행 순으로 접근하기 (읽기전용)

In [40]:
df['국어'][0]

98

#### 행 > 열 순으로 접근 하기 (읽기, 쓰기 겸용 / 권장)

In [41]:
df.loc[0,'국어']

98

#### 특정 값 변경하기 -> 행 우선 접근 방법으로만 가능

In [42]:
df.loc[0,'국어']=99
df

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   99   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0